OpenFOAM/WFD_OpenFOAM/cases/overnight_20260527_224229_bca724/pitch_8p5_slim_chord/0/include/frontBackUpperPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

upperWall
{
    type symmetryPlane;
}

"(front|back)"
{
    type symmetryPlane;
}

// ************************************************************************* //
