OpenFOAM/WFD_OpenFOAM/cases/overnight_20260527_224229_bca724/pitch_8p5_slim_chord/system/streamlines
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

type            streamlines;
libs            ("libfieldFunctionObjects.so");

// Output every
writeControl    writeTime;

// Write format
setFormat       vtk;

// Track forward (+U) or backward (-U) or both
direction       forward;

// Names of fields to sample. Should contain above velocity field!
fields          (p U);

// Steps particles can travel before being removed
lifeTime        10000;

// Number of steps per cell (estimate). Set to 1 to disable subcycling.
nSubCycle       5;

// Cloud name to use
cloudName       particleTracks;

// Seeding method.
seedSampleSet
{
    type        lineUniform;
    start       (-1.001 1e-7 0.0011);
    end         (-1.001 1e-7 1.0011);
    nPoints     20;
}


// ************************************************************************* //
